document.addEventListener('DOMContentLoaded', () => {
    const products = [
        {
            name: 'Компресор без масляний поршневий 18л 220В  AUARITA 2-900F18-220',
            description: 'Компресор безмасляний об\'ємом 18 літрів - це потужний і надійний інструмент, який використовується для створення стисненого повітря для різних застосувань. Цей компресор працює без використання олії, що робить його практичним і екологічно чистим. Він оснащений вбудованим резервуаром об\'ємом 18 літра, що забезпечує достатній об\'єм повітря для різних завдань. мастила поршнів і циліндрів Це дозволяє уникнути забруднення генерованого компресором повітря і зберегти його чистим для використання в чутливих додатках, таких як фарбування або робота з електронікою Крім того, відсутність олії полегшує обслуговування компресора і зменшує витрати на підтримку. , майстернях, будівельних майданчиках, а також у домашніх гаражах та майстернях. Він підходить для виконання різних завдань, такихFF як накачування шин, використання пневмоінструменту, чищення повітряних фільтрів, фарбування, струменеве піскоструминне очищення та багато інших. Загалом компресор є надійним і високоефективним інструментом, що допомагає забезпечити потужне і стабільне стиснене повітря для різних застосувань. Його безмасляна конструкція робить його зручним в експлуатації та екологічно чистим інструментом, що використовується.',
            price: '5 899₴',
            images: ['7.1.jpg']
        },
        {
            name: 'Компресор безмасляний поршневий 24л 220В  AUARITA 2-1450F24-220',
            description: "",
            price: '7 399₴',
            images: ['7.2.jpg']
        },
        {
            name: 'Компресор безмасляний поршневий 40л 220В  AUARITA 2-900X2F40-220',
            description: "Компресор безмасляний об'ємом 40 літрів є потужним і надійним інструментом, що використовується для створення стисненого повітря для різних застосувань. Його поршні рухаються по внутрішній камері, створюючи стиснене повітря, а вбудований резервуар об'ємом 40 літрів забезпечує достатній обсяг повітря для різних завдань. Компресор оснащений вбудованим механізмом регулювання тиску, що дозволяє налаштовувати потрібний тиск відповідно до вимог роботи. Завдяки безмасляній конструкції він є екологічно чистим та практичним, не потребує використання масла для змащування поршнів і циліндрів. Це робить його зручним для використання в чутливих застосуваннях, таких як фарбування або робота з електронікою, і зменшує витрати на обслуговування. Компресор часто використовується в автомобільних сервісних центрах, майстернях, будівельних майданчиках, а також у домашніх гаражах і майстернях. Він підходить для виконання різних завдань, таких як накачування шин, використання пневмоінструменту, чистка повітряних фільтрів, фарбування, струменеве піскоструминне очищення та багато інших. Цей компресор є надійним і високоефективним інструментом, що забезпечує потужне і стабільне стиснене повітря для широкого спектру застосувань. Його безмасляна конструкція робить його зручним в експлуатації та екологічно чистим інструментом.",
            price: '11 899₴',
            images: ['7.3.jpg']
        },        
        {
            name: 'Компресор безмасляний поршневий 50л 220В  AUARITA 2-1450X2F50-220',
            description: "",
            price: '13 959₴',
            images: ['7.4.jpg']
        },
        {
            name: 'Компресор поршневий з ремінним приводом, Vрес=100л, 350л/хв, 220V, 2,2кВт FIAC AB100-360-220-ITALY',
            description: "Компресор повітряний ремінний FIAC AB100-360-220 - це професійний інструмент, призначений для використання в шиномонтажних та ремонтно-будівельних роботах, а також на дачі та в гаражі. Вироблений в Італії, цей компресор оснащений поршневим блоком від 'FIAC' - AB-360, що гарантує його надійну роботу при інтенсивних навантаженнях. Технічні особливості компресора включають: • Чавунний поршневий блок FIAC, який забезпечує довговічність та стійкість до зносу. • Візуальний контроль тиску в ресивері та на виході за допомогою манометрів. • Регулювання тиску на виході, що дозволяє точно налаштувати роботу компресора під конкретні завдання. • Візуальний контроль рівня оливи через оглядове вікно, що спрощує обслуговування. • Електромеханічний блок управління тиском у ресивері, що забезпечує автоматичне підтримання потрібного тиску. • Запобіжний механічний клапан високого тиску для забезпечення безпеки. • Дренажний клапан для зливу конденсату, що запобігає накопиченню вологи в ресивері. • Швидкороз'ємне з'єднання для підключення інструменту, що спрощує експлуатацію. • Зручна ручка для переміщення компресора, що робить його мобільним. • Змінний повітряний фільтр для підтримання чистоти повітря. • Колеса та упори в комплекті, що забезпечують стійкість та легкість переміщення. Цей компресор ідеально підходить для виконання різноманітних завдань, що вимагають надійного та стабільного стисненого повітря.",
            price: '29 399₴',
            images: ['7.5.jpg']
        },
        {
            name: 'Компресор поршневий Vрес=50л 170л/хв 220V AIRKRAFT AK50-170-ITALY',
            description: "Компресор повітряний AIRKRAFT AK50-170-ITALY - це класичний поршневий оливний компресор, оснащений 50-літровим ресивером. Він ідеально підходить для використання в домашніх умовах, гаражі або на дачі. Цей компресор здатний справлятися з різними завданнями, такими як фарбування за допомогою фарбопульта, продувка механізмів, накачування коліс і повітряних конструкцій, а також робота з різним пневмоінструментом. Основні особливості компресора: • Потужність і продуктивність: У своєму класі компресорів з прямим приводом, AIRKRAFT AK50-170-ITALY вважається одним з найпотужніших, забезпечуючи продуктивність до 170 л/хв. • Алюмінієвий кожух: Захищає компресор від перегріву, збільшуючи його надійність і довговічність. • Регулятор тиску: Дозволяє точно налаштовувати тиск на виході, забезпечуючи оптимальну роботу з різними інструментами. • Два манометри: Забезпечують візуальний контроль тиску в ресивері та на виході. • Великі колеса: Забезпечують легкість транспортування, роблячи компресор мобільним і зручним у використанні. • Компактні розміри: Невеликі габарити роблять його зручним для зберігання і використання в обмежених просторах. Цей компресор поєднує в собі високу продуктивність і надійність, що робить його чудовим вибором для різних завдань у побутових і професійних умовах.",
            price: '14 599₴',
            images: ['7.6.jpg']
        },        
        {
            name: 'Компресор поршневий з ремінним приводом, Vрес=100л, 350л/хв, 380V, 2,2кВт AIRKRAFT (аналог DEC100-330T-380-ITALY) AK100-360T-380-ITALY',
            description: "Компресор повітряний ремінний AIRKRAFT AK100-360T-380-ITALY - це професійний інструмент, вироблений в Італії, призначений для шиномонтажних та ремонтно-будівельних робіт, а також для використання на дачі та в гаражі. Завдяки своїм технічним характеристикам і надійній конструкції, він ідеально підходить для виконання різних завдань, що вимагають стисненого повітря. Технічні особливості: • Чавунний поршневий блок: Забезпечує довговічність і надійність роботи компресора, стійкість до зносу і перегріву. • Візуальний контроль тиску: Два манометри дозволяють контролювати тиск у ресивері та на виході, забезпечуючи точне налаштування і безпеку роботи. • Регулювання тиску на виході: Дозволяє налаштовувати необхідний тиск відповідно до вимог різних інструментів і завдань. • Візуальний контроль рівня оливи: Оглядове вікно дозволяє стежити за рівнем оливи, забезпечуючи правильне обслуговування і запобігаючи пошкодженням компресора. • Електромеханічний блок управління тиском: Забезпечує автоматичне включення і вимкнення компресора залежно від тиску в ресивері. • Запобіжний механічний клапан: Забезпечує захист від надмірного тиску, гарантуючи безпеку експлуатації. • Дренажний клапан: Дозволяє зливати конденсат, запобігаючи корозії і продовжуючи термін служби компресора. • Швидкороз'ємне з'єднання: Забезпечує зручне і швидке підключення пневмоінструменту. • Зручна ручка: Полегшує переміщення компресора, роблячи його мобільним і зручним у використанні. • Змінний повітряний фільтр: Забезпечує чистоту повітря, що надходить у компресор, захищаючи внутрішні механізми від забруднень. • Колеса та упори: Входять у комплект, забезпечуючи стійкість і легкість транспортування компресора. Цей компресор поєднує високу продуктивність, надійність і зручність експлуатації, що робить його чудовим вибором як для професіоналів, так і для любителів.",
            price: '33 299₴',
            images: ['7.7.jpg']
        },
        {
            name: 'Компрессор поршневой Vрес=50л, 170л/мин, 220V, 1,5кВт FIAC - AIR FORCE 1129502953',
            description: "Компресор повітряний FIAC AIR FORCE 1129502953 - це класичний поршневий оливний компресор, виконаний на ресивері об'ємом 50 літрів. Цей компресор ідеально підходить для використання в домашніх умовах, гаражах і на дачах. Він призначений для виконання широкого спектру завдань, таких як фарбувальні роботи з фарбопультом, продувка різних механізмів, накачування коліс і повітряних конструкцій, а також робота з численним пневмоінструментом. Особливості компресора: • Два манометри на виході: Забезпечують візуальний контроль тиску на виході, що дозволяє точно налаштовувати робочі параметри для різних інструментів і завдань. • Великі колеса для транспортування: Полегшують переміщення компресора, забезпечуючи його мобільність і зручність використання. • Невеликі габарити: Компактні розміри компресора дозволяють легко розміщувати його в обмежених просторах, таких як гаражі або майстерні, і спрощують його зберігання. Цей компресор поєднує в собі високу продуктивність і надійність, що робить його чудовим вибором як для професіоналів, так і для любителів.",
            price: '9 099₴',
            images: ['7.8.jpg']
        },
    ];

    const productList = document.getElementById('product-list');
    products.forEach(product => {
        const productItem = document.createElement('div');
        productItem.className = 'catalog-item';

        const productImages = document.createElement('div');
        productImages.className = 'product-images';

        if (product.images.length > 1) {
            product.images.forEach((image, index) => {
                const img = document.createElement('img');
                img.src = image;
                img.alt = product.name;
                img.className = index === 0 ? 'active' : 'hidden';
                productImages.appendChild(img);
            });

            const prevButton = document.createElement('button');
            prevButton.textContent = '<';
            prevButton.className = 'carousel-button';
            prevButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex - 1 + product.images.length) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const nextButton = document.createElement('button');
            nextButton.textContent = '>';
            nextButton.className = 'carousel-button';
            nextButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex + 1) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const carouselButtons = document.createElement('div');
            carouselButtons.className = 'carousel-buttons';
            carouselButtons.appendChild(prevButton);
            carouselButtons.appendChild(nextButton);

            productImages.appendChild(carouselButtons);
        } else {
            const img = document.createElement('img');
            img.src = product.images[0];
            img.alt = product.name;
            productImages.appendChild(img);
        }

        const productDetails = document.createElement('div');
        productDetails.className = 'product-details';

        const productName = document.createElement('h3');
        productName.textContent = product.name;

        const productDescription = document.createElement('p');
        productDescription.textContent = product.description;

        const productPrice = document.createElement('p');
        productPrice.className = 'price';
        productPrice.textContent = `Ціна: ${product.price}`;

        const buyButton = document.createElement('a');
        buyButton.href = 'https://t.me/auto_tool_set';
        buyButton.textContent = 'Купити';
        buyButton.className = 'buy-button';

        productDetails.appendChild(productName);
        productDetails.appendChild(productDescription);
        productDetails.appendChild(productPrice);
        productDetails.appendChild(buyButton);

        productItem.appendChild(productImages);
        productItem.appendChild(productDetails);

        productList.appendChild(productItem);
    });
});