document.addEventListener('DOMContentLoaded', () => {
    const products = [
        {
            name: 'Автомобільний мультимарочний сканер LAUNCH X-431 PRO',
            description: 'X-431 PRO+ Збільшено: екран до 8 дюймів, батарею до 4290мАг, пам\'ять до 16ГБ, програм до 110шт + новий адаптер DBScarII. При покупці сканера до кінця 2021 року, безкоштовні оновлення програмного забезпечення протягом 2 років у подарунок. Багатомарковий сканер Launch X-431 PRO+ 2017 року – це той самий PRO, але трохи більший за розміром, проте з покращеною автономністю. X-431 PRO+ 2017 року комплектується діагностичним адаптером нового покоління - DBScar II, планшетом з екраном 8 дюймів з збільшеним обсягом пам\'яті та підвищеною ємністю батареї. Все це робить його не тільки швидким і зручним у роботі, але й, що важливо, більш надійним! LAUNCH X-431 PRO - це прилад нового покоління серії X-431. Автосканер X-431 PRO створений на основі новітніх розробок в області телематики. Цей сканер має вигляд планшетного комп’ютера з зручними габаритами та ємнісним сенсорним кольоровим екраном. Багатомарковий сканер функціонує на базі операційної системи Android, що дозволяє приладу працювати в рази швидше за його попередників із серії X-431, а саме, прилади X-431, X-431 Master і X-431 IV. Стандартне ПЗ пристрою підтримує 110 програм, що дозволяє сканеру покрити практично весь український ринок автомобілів і провести їх якісну діагностику. X-431 PRO додатково комплектується великою кількістю перехідників для різних марок автомобілів. Ми надаємо 12 місяців ОФІЦІЙНОЇ гарантії на сканер X-431 PRO. Увага! Ця акція не поширюється на «піратські» (сірі) та куплені в інших країнах прилади. Офіційний LAUNCH X-431 PRO відрізняється за вартістю від «сірого», але його покупка несе багато переваг, а також повну сервісну підтримку на території України.',
            price: '52 499₴',
            images: ['2.1.jpg']
        },
        {
            name: 'Автомобільний мультимарочний сканер LAUNCH X-431 PRO SE',
            description: 'Автомобільний мультимарочний сканер LAUNCH X-431 PRO SE У першому кварталі 2022 року компанія Launch анонсувала чергову 5-ту генерацію свого найпопулярнішого сканера серії PRO, а вже на початку наступного 2023 року з\'явилася її спеціальна конфігурація SE (Special Edition). Традиційно всі покоління PRO, включаючи п\'яте, мали стандартний комплект, що складається з планшета, окремого діагностичного BT-адаптера та набору додаткових не OBD роз\'ємів, але перша конфігурація SE вийшла в "полегшеному" варіанті без додаткових роз\'ємів (опція) і кейса для зберігання сканера. 8-дюймовий планшет став компактнішим і набагато потужнішим: дискретна плата на базі Android 10.0 оснащена 4-ядерним 2 ГГц процесором, 4 ГБ ОЗП і 64 ГБ флеш-диском. Одна тилова камера, USB роз\'єми (тип-C і тип-A), мікрофон, аудіо-роз\'єми, кнопки управління звуком та депо для BT-адаптера відсутні. Попередньо встановлена остання 7-ма версія APP з підтримкою повороту екрану. Новий адаптер версії VII оснащений USB роз\'ємом (тип-C) і підтримує всі основні протоколи, включаючи один з останніх DoIP. Важливий прорив для серії PRO - можливість використання модулів розширення O2-X і S2-2. Ще один нюанс SE - додаток сканера не попередньо встановлений на заводі, тепер його потрібно інсталювати самостійно на етапі реєстрації. Зверніть увагу: PRO V5.0 і PRO 5 це різні сканери, хоч і одного класу, але з різною комплектацією та програмно-апаратною платформою. Можливості X-431 PRO V5.0 / SE підтримує діагностику всіх електронних систем управління автомобілів європейського, американського та азійського виробництва (включаючи праворульні японські автомобілі). Широкий діапазон марок автомобілів: Smart, America Ford, Chrysler, GM, Acura, INFINITI, Lexus, Australia Ford, Holden, Brazil GM, Brazil Fiat, Brilliance Auto, BYD, Changan, ChangCheng, Changhe, Chery, GEELY, Gonow Auto, HaFei, JAC, Jiangling, SGMW, Tianjin FAW, Xiamen, XinKai, ZhongShun, Zhongxing, ZOTYE, Audi, Benz, BMW, Citroen, Europe Ford, Fiat, Jaguar, Lancia, Landrover, Opel, Peugeot, Porsche, Renault, Romeo, Rover, Saab, Seat, Skoda, Transporter&V-Class, Volkswagen, Volvo, Mahindra, MARUTI, TATA, Daihatsu, Honda, JPIsuzu, Mazda, Mitsubishi, Nissan, Subaru, Suzuki, Toyota, Daewoo, Hyundai, Kia, Ssangyong, Perodua, Proton, S.Africa Opel, Thailand Isuzu, а також будь-які автомобілі, що підтримують стандарт OBDII/EOBD (шини даних SAE J1850 VPW, SAE J1850 PWM, ISO 9141-2, ISO 14230, ISO-15765-4 CAN, DoIP (ISO 13400)). Функції • Читання і стирання кодів несправностей • Ідентифікація блоків управління • Читання поточних параметрів • Перевірка виконавчих механізмів • Адаптація блоків управління • Кодування блоків управління • 38 окремих програм спецфункцій для основних операцій ТО • Віддалена діагностика • Інтелектуальна діагностика • Діагностична історія Переваги • Діагностичний DBScar VII (Bluetooth / USB) без вбудованого OBDII роз\'єму (використовує подовжувальний кабель-перехідник) • Підтримка новітнього протоколу DoIP • Зручне меню українською мовою, просте управління • Інтерфейс максимально наближений до оригінальних дилерських приладів • Відсутність блокування після закінчення терміну підписки • Більше 90 марок в базовому комплекті з більш ніж 200 доступних • Широкий набір з 38 універсальних програм спецфункцій в окремому меню • Підтримка бездротового друку результатів діагностики на міні-принтері • Підтримка відеоендоскопа VSP-600 • Підтримка додаткових модулів розширення: ADAS, X-PROG, X-PROG 3, TS-GUN, BST-360, Oscilloscope O2-X, Sensorbox S2-2 • Функціональні можливості та карта покриття постійно розширюються • 12 адаптерів OBD-I у комплекті* для діагностики автомобілів з нестандартними роз\'ємами.',
            price: '52 499₴',
            images: ['2.2.jpg']
        },
        {
            name: 'Універсальний комплект для програмування ключів і базової діагностики автомобіля (2 в 1) - LAUNCH X-431 IMMO PRO.',
            description: "Це унікальний автомобільний сканер, спеціально призначений для фахівців, які займаються програмуванням ключів для автомобілів. LAUNCH X-431 IMMO PRO - це сучасний професійний інструмент, який є простим і ідеальним рішенням для спеціалістів, що працюють з іммобілайзерами та програмуванням додаткових ключів для авто. Цей сканер також забезпечує всі необхідні діагностичні функції та процедури для ремонту і обслуговування автомобілів. LAUNCH IMMO PRO - це мультимарочний програматор ключів, що підтримує базові діагностичні і сервісні функції для обслуговування автомобілів. Його можна використовувати як часткові майстри з обслуговування автомобілів, так і великі автосервіси для розширення середнього чеку за рахунок надання повного спектру послуг з обслуговування та ремонту автомобілів. Launch IMMO PRO - це сучасний інтелектуальний мультимарочний програматор автомобільних ключів, який поєднує базові діагностичні та сервісні функції для обслуговування автомобілів. Завдяки широкому спектру підтримуваних марок та функціональності, він ідеально підходить як для приватних майстрів, так і для автосервісів будь-якого розміру. З його допомогою можна виконувати інтелектуальну діагностику, включаючи читання/очищення кодів несправностей, потокову передачу даних в реальному часі та інші функції. Підтримка протоколів связи CAN FD і DoIP робить його універсальним інструментом для сучасних автомобілів. Універсальний інформаційний центр допомагає відстежувати історію діагностики та отримувати останні оновлення. Щодо функціональних особливостей, IMMO PRO забезпечує широкий спектр можливостей, включаючи сопоставлення/копіювання ключів, заміну противоугонних модулів та багато іншого. Його можливості дозволяють працювати з автомобілями різних марок, що робить його вельми корисним інструментом для фахівців автомобільного сервісу.",
            price: '52 699₴',
            images: ['2.3.jpg']
        },
        {
            name: 'Диагностический адаптер нового поколения для грузовиков и легкого коммерческого транспорта X-431 HDIII LAUNCH',
            description: "Launch X-431 HD BOX III - це модуль, який розширює можливості діагностики, надаючи можливість виконувати діагностику грузових автомобілів. Він призначений для використання зі сканерами Launch X-431 PRO3 та X-431 PAD II. Основні функціональні особливості включають повний комплект програмного забезпечення для діагностики грузових автомобілів, гарантію точності тестових даних та постійне оновлення програмного забезпечення для отримання нового функціоналу. Модуль підтримує діагностику грузовиків з дизельними двигунами з акумуляторами 12 В або 24 В, при цьому немає потреби у конвертації акумулятора для тестування 24-вольтових грузовиків. У комплекті йдуть перехідники та кабелі для різних моделей від різних виробників. Модуль має ряд переваг порівняно з попереднім поколінням, зокрема, додано індикатори стану з'єднання в реальному часі та покращений промисловий дизайн з водонепроникністю та захистом від пилу за класом захисту IP65. Підтримувані марки автомобілів включають Mercedes-Benz, Man, Volvo, Scania, lveco, OAF, Renault (Європа), Freightliner, International, Kenworth, Peterbilt, Stering, Western Star, Mack, Detroit Engine, Cummins Engine (США), Hino, Fuso, Isuzu, UD, Hyundai, Chinese HD truck (Азія).",
            price: '48 299₴',
            images: ['2.4.jpg']
        },
        {
            name: 'Автомобильный сканер LAUNCH Creader-981',
            description: "Creader 981 - це потужний діагностичний сканер нового покоління від компанії LAUNCH для обслуговування європейських, американських і азіатських марок автомобілів. Він має 4-дюймовий кольоровий TFT дисплей, захисний обрезинений корпус, кабель USB і карту пам'яті з флешкою для підключення до ПК. Додатково постачається фірмова матерчата сумка для зберігання і переносу. Функціонал сканера підтримує 10 спеціальних функцій скидання і діагностику автомобіля за протоколом OBDII з підтримкою всіх 10-ти тестових режимів OBDII. Спеціальні програми скидання включають функції скидання і обслуговування стояночного гальма, калібрування кута нульової точки в системі ESP, скидання і навчання АКБ, принудну статичну або динамічну регенерацію частинок сажевого фільтра та інші. Сканер також підтримує всі 10 функцій OBDII, такі як читання/скидання DTC, перевірка статусу Check Engine, читання Freeze Frame, інформація про автомобіль та інші. Підтримувані марки автомобілів включають Acura, Daewoo, Honda, Holden, Hyundai, Infiniti, Isuszu, KIA, Lexus, Mahindra, Maruti, Mazda, Mitsubishi, Nissan, Subaru, Suzuki, Toyota, Tata, Chrysler, Ford, GM, EU-Ford, AUS-Ford, Alpha-ROMEO, Audi, Benz, BMW, Citroen, Dacia, Fiat, Jaguar, Lancia, Landrover, Mini, Opel, Peugeot, Porsche, Renault, Saab, Seat, Smart, Sprinter, Vauxhall, Volvo, VW. Сканер також має можливість мультиязичної підтримки, оновлення через Інтернет, вбудовану бібліотеку розшифровки кодів несправностей і абревіатур, можливість друку даних на ПК та графічне відображення даних.",
            price: '12 799₴',
            images: ['2.5.jpg']
        },
        {
            name: 'Автомобильный сканер Creader Premium CRP-123 LAUNCH',
            description: "CReader Professional 123 - це портативний сканер для автолюбителів і майстрів приймальників, який підтримує діагностику електронних систем управління автомобілів європейського, американського і азіатського виробництва. Він ідеально підходить для тих, кому діагностика - це додаткова послуга, де не потрібно мати повний доступ до блоків управління автомобіля. Creader Professional 123 підтримує такі функції, як підтримка російської мови, перевірка готовності автомобіля, читання потоку даних, перегляд 'стоп-кадра' різних діагностичних даних, тест датчика кисню O2, спеціальний тест бортових систем автомобіля, тест системи улавливання паливних випарів, читання і видалення кодів несправностей автомобіля (всі функції OBDII з 1996 року по н.в.), перегляд описів кодів помилок. Автосканер Launch Creader Professional 123 призначений, переважно, для автолюбителів, а також для невеликих автосервісів. Це ідеальний варіант для тих, кому діагностика - це додаткова послуга, де потрібно мати повний доступ лише до основних блоків управління автомобіля (двигун ENG, АКПП, ABS, SRS).",
            price: '9 199₴',
            images: ['2.6.jpg']
        },
        {
            name: 'Автомобильный сканер Creader Professional CRP-239 LAUNCH',
            description: "Creader CRP 239 Professional LAUNCH - це портативний мультимарочний сканер для автолюбителів і автосервісів, який підтримує діагностику електронних систем управління автомобілів європейського, американського і азіатського виробництва. Його особливості включають сенсорний екран 5 дюймів, батарею на 4000 мАч, вбудовану пам'ять на 8 Гб. У комплект поставки входять сканер, основний кабель OBDII, кабель живлення, сумка-чохол і інструкція. Це ідеальний варіант для тих, кому діагностика - це додаткова послуга, де потрібно мати повний доступ лише до основних блоків управління автомобіля (двигун, АКПП, ABS, SRS). Сканер підтримує діагностику всіх автомобілів з 1996 року, які підтримують один з протоколів передачі даних OBDII і мають в салоні діагностичний роз'єм OBDII на 16 контактів. Він також має 6 сервісних функцій скидання: BRAKE RESET, OIL RESET, SAS RESET, BAT. RESET, ELEC. THROTTLE RLRN, DPF Regeneration. Сканер також підтримує считування VIN-коду автомобіля, перевірку готовності систем автомобіля до відповідності екологічним нормам (функція I/M), перевірку стану акумулятора автомобіля та автоматичне збереження звітів про діагностику і їх відправлення на електронну пошту.",
            price: '15 799₴',
            images: ['2.7.jpg']
        },
        {
            name: 'Набір перехідників і кабелів для електромобілів TESLA LAUNCH SPLT-301181050',
            description: "Набір перехідників і кабелів для електромобілів TESLA - це комплект важливих аксесуарів, які дозволяють зручно і безпечно заряджати ваш електромобіль Tesla у будь-якій ситуації та місці. Цей набір розроблений спеціально для власників та користувачів автомобілів Tesla. У комплекті високоякісний кабель зарядки, що з'єднує ваш електромобіль Tesla з джерелом живлення. Набір включає різноманітні перехідники та адаптери, що дозволяють підключати ваш електромобіль до різних типів зарядних станцій та розеток. Це особливо корисно під час подорожей, коли стандарти розеток можуть відрізнятися в різних країнах. Продукція TESLA відома своєю високою якістю та безпекою. Набір протестований та сертифікований для використання з електромобілями TESLA, забезпечуючи надійне та безпечне заряджання. Розроблений для сумісності з різними моделями електромобілів Tesla, включаючи Model S, Model 3, Model X та Model Y. Завдяки цьому аксесуару власники електромобілів Tesla можуть насолоджуватися більшою свободою та зручністю під час зарядки свого автомобіля, навіть у віддалених місцях або за кордоном. Такий набір стає невід'ємною частиною експлуатації Tesla і допомагає забезпечити надійне живлення вашого транспортного засобу.",
            price: '6 299₴',
            images: ['2.8.jpg']
        },
        {
            name: 'Стенд для диагностики и чистки форсунок (GDI, EFI, SFI) LAUNCH (GDI-605S) CNC-605A',
            description: "Launch GDI-605S - це установка для тестування та очищення форсунок, яка має кілька відмінних особливостей: 1 Оновлений корпус стенда з високоякісного пластика. 2 Дружній інтуїтивно зрозумілий інтерфейс, доступний на російській мові. 3 Вбудована ультразвукова ванна в корпусі стенда. 4 Пластикові колби, які є більш міцними та довговічними, замінюють скляні. 5 Можливість діагностики до 6 форсунок одночасно. 6 Компактні розміри та легка вага стенда. Функціональні можливості включають: 1 Очищення та тестування форсунок шляхом імітації умов робочого двигуна. 2 Ультразвукове очищення. 3 Тест на рівномірність. 4 Тест розпилювання форсунки. 5 Тест герметичності паливних ліній з використанням манометра. 6 Тест впрыскованого потоку. 7 Тестування у автоматичному режимі, з трьома попередньо налаштованими автоматичними тестами. Для роботи використовуються спеціальні рідини, серед яких: 1 Рідина для ультразвукової ванни: Ln2003, InjCleaner, DG, Technik-Z, Ecosonic ADS, ULTRA CLEAN. 2 Рідина для тестування форсунок: Ln2004, InjTest, E-19, SMC-TECT, ECOTEST CAS, Exxsol D60. Важливо використовувати рідини, які рекомендовані, оскільки використання інших може призвести до порушення функціональності обладнання в цілому",
            price: '50 399₴',
            images: ['2.9.jpg']
        },
    ];

    const productList = document.getElementById('product-list');
    products.forEach(product => {
        const productItem = document.createElement('div');
        productItem.className = 'catalog-item';

        const productImages = document.createElement('div');
        productImages.className = 'product-images';

        if (product.images.length > 1) {
            product.images.forEach((image, index) => {
                const img = document.createElement('img');
                img.src = image;
                img.alt = product.name;
                img.className = index === 0 ? 'active' : 'hidden';
                productImages.appendChild(img);
            });

            const prevButton = document.createElement('button');
            prevButton.textContent = '<';
            prevButton.className = 'carousel-button';
            prevButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex - 1 + product.images.length) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const nextButton = document.createElement('button');
            nextButton.textContent = '>';
            nextButton.className = 'carousel-button';
            nextButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex + 1) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const carouselButtons = document.createElement('div');
            carouselButtons.className = 'carousel-buttons';
            carouselButtons.appendChild(prevButton);
            carouselButtons.appendChild(nextButton);

            productImages.appendChild(carouselButtons);
        } else {
            const img = document.createElement('img');
            img.src = product.images[0];
            img.alt = product.name;
            productImages.appendChild(img);
        }

        const productDetails = document.createElement('div');
        productDetails.className = 'product-details';

        const productName = document.createElement('h3');
        productName.textContent = product.name;

        const productDescription = document.createElement('p');
        productDescription.textContent = product.description;

        const productPrice = document.createElement('p');
        productPrice.className = 'price';
        productPrice.textContent = `Ціна: ${product.price}`;

        const buyButton = document.createElement('a');
        buyButton.href = 'https://t.me/auto_tool_set';
        buyButton.textContent = 'Купити';
        buyButton.className = 'buy-button';

        productDetails.appendChild(productName);
        productDetails.appendChild(productDescription);
        productDetails.appendChild(productPrice);
        productDetails.appendChild(buyButton);

        productItem.appendChild(productImages);
        productItem.appendChild(productDetails);

        productList.appendChild(productItem);
    });
});