document.addEventListener('DOMContentLoaded', () => {
    const products = [
        {
            name: 'Набір інструменту  1/4"&1/2"  28од.  TOPTUL GCAD2802',
            description: "Кейс виготовлений із металу і має такі розміри: ширина 32,4 см, довжина 14,9 см і висота 4,8 см. Закриття кейсу здійснюється за допомогою металевого замка. Інструменти зручно розташовані всередині кейсу, кожен предмет займає своє місце в виїмці. Набір включає в себе: • 20 торцевих головок з шестигранним профілем від 5 до 27 мм; • два трещотки з 36 зубцями та металевими ручками; • вороток з плаваючою головкою; • два кардани; • два подовжувача довжиною 100 і 125 мм. Цей набір містить найнеобхідніші та часто використовувані елементи. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GCAD2802. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '2 699₴',
            images: ['3.1.jpg']
        },
        {
            name: 'Набір інструменту  1/2"  (дюйм+метр.) 43од.  TOPTUL GCAD4303',
            description: "Набір інструментів 1/2' (дюйм + метр.) на 43 одиниці. Кейс виготовлений із металу і має такі розміри: ширина 44,5 см, довжина 18,8 см і висота 5 см. Закриття кейсу здійснюється за допомогою двох металевих замків. Інструмент компактно розташований всередині кейсу. Набір включає в себе: • 20 торцевих головок із шестигранним профілем розмірами від 8 до 32 мм; • 14 торцевих головок дюймового розміру; • кардан; • дві свічні головки; • три подовжувачі довжиною 75, 125 і 250 мм; • перехідник з отвором з 3/8 до 1/2; • вороток із шарніром. Toptul GCAD4303 - це універсальне рішення для всіх авторемонтних завдань для особи з будь-яким рівнем підготовки. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GCAD4303. На всі торцеві головки і ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '5 449₴',
            images: ['3.2.jpg']
        },
        {
            name: 'Набір інструменту  1/2"  55од.  TOPTUL GAAI5502',
            description: "Набір інструментів 1/2' на 55 одиниць TOPTUL GAAI5502. Кількість предметів у кейсі: 55 од. Присоединительний квадрат: 1/2'. Розміри метричні з 6 граней. Кейс виготовлений із пластика. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GAAI5502. На всі торцеві головки і ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '6 349₴',
            images: ['3.3.jpg']
        },
        {
            name: 'Набір інструменту комбінованих  80од.  TOPTUL GCAI8002',
            description: "Набір інструментів комбінований TOPTUL GCAI8002, 80 шт. Відзначено наявність слюсарного інструменту, який підійде як для СТО, так і для особистого використання. Увесь інструмент тісно защільнується в своїх гніздах, що уникне випадіння. Комплектація включає: 10 торцевих головок з 6-гранним профілем від 4 до 13 мм та 3 довгі головки з квадратом 1/4 дюйма. А також 11 торцевих головок з 6-гранним профілем від 14 до 32 мм та 3 довгі головки з квадратом 1/2 дюйма. Для кожного квадрата передбачені трещітки, воротки, подовжувачі та кардани. Також у комплекті дві свічні головки. Відзначено також наявність слюсарного інструменту, такого як: комбіновані ключі з рожково-накидним профілем, відвертки, плоскогубці, круглогубці, довгі губці та молоток. Увесь інструмент у наборі метричний, ручки прорезинені, квадрати присоединительные 1/2 та 1/4 дюйма. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GCAI8002. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '8 149₴',
            images: ['3.4.jpg']
        },
        {
            name: 'Набір інструменту комбінованих  82од.  TOPTUL  GCAI8201',
            description: "Набір професійного інструменту від TOPTUL GCAI8201 (Тайвань). Набір складається з 82 одиниць інструменту, торцеві головки мають 6 граней для зручності відкручування 'приклеєних' гайок. Відмітною особливістю набору TOPTUL GCAI8201 є наявність комбінованих (рожково-накидних) ключів до 22 мм. На одному кінці тіла такого ключа розташована рожкова головка, а на іншому - накидна (12-гранна) головка. Обидві головки цих ключів мають однаковий розмір. Присоединительный квадрат для трещеток і воротков: 1/4' та 1/2'. Усі розміри інструменту в наборі - метричні, кейс виготовлений з міцного пластику. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GCAI8201. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '5 249₴',
            images: ['3.5.jpg']
        },
        {
            name: 'Набір інструменту   1/4"&1/2"  94од. (6-гр.) new box  TOPTUL GCAI094R',
            description: "Набір професійного інструменту марки TOPTUL GCAI094R (Тайвань). Набір складається з 94 одиниць інструменту, торцеві головки мають 6 граней для зручності відкручування 'приклеєних' гайок. Відмітною особливістю набору TOPTUL GCAI094R є його низька вартість серед подібних наборів професійного інструменту марки TOPTUL. Даний набір за комплектацією є повним аналогом набору на 108 одиниць, за винятком специфічних головок Е профіля (внутрішній TORX). Присоединительный квадрат для трещеток і воротков: 1/4' та 1/2'. Усі розміри інструменту в наборі - метричні, кейс виготовлений з міцного пластику. Також є можливість окремо придбати БУДЬ-ЯКИЙ інструмент з набору TOPTUL GCAI094R. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '5 099₴',
            images: ['3.6.jpg']
        },
        {
            name: 'Набір інструменту   1/4"&1/2"  94ед. (12-гр.) new box  TOPTUL GCAI094R1',
            description: "Набір інструменту 1/4' та 1/2' 94од. (12-грані) в новій упаковці. Набір включає: • 13 торцевих 12-гранних головок від 4 до 14мм та 8 довгих головок розміром від 6 до 13мм на присоединительный квадрат ¼ дюйма. • 16 торцевих 12-гранних головок від 10 до 32мм та 5 довгих головок від 14 до 22мм на присоединительный квадрат ½ дюйма. • Насадки та головки з насадками: шліц, HEX, TORX, PH1, PH2, PH3, PH4, PZ1, PZ2, PZ3, PZ4. • 4 удлинителя, вороток-відвіртувач, 2 кардана, вороток з плаваючою головкою, перехідник з отвором, 2 трещотки, тримач біт, 2 свічкові головки та 3 12-гранних г-подібних ключа. Весь інструмент в наборі метричний, ручки прорезинені. Присоединительные квадрати ½ та 1/4 дюйма. Також є можливість придбати БУДЬ-ЯКИЙ інструмент окремо з набору TOPTUL GCAI094R1. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '5 299₴',
            images: ['3.7.jpg']
        },
        {
            name: 'Набір інструменту комбінованих 96од.  TOPTUL GCAI9601',
            description: "В цей набір включено: • 9 торцевих 6-гранних головок від 4 до 10мм на ¼ дюйма, • Головки Е-профіля, • 20 торцевих 6-гранних головок від 8 до 32 мм на 1/2 дюйма, • 11 комбінованих ключів від 8 до 19 мм, • 4 разрізних ключа, • Відвертки хрестоподібні та шліцеві, • Три удлинителя, держатель біт, два кардана, вороток, вороток-відвіртувач, • Гнучкий удлинитель та насадки: HEX і TORX. Увесь інструмент у наборі метричний. Присоединительные квадрати ¼ та ½ дюйма. Набір інструментів Toptul - незамінний помічник для робіт будь-якої складності, який завжди повинен бути під рукою. Це універсальний набір, який стане ідеальним помічником як для професіонала, так і для любителя. Також є можливість придбати БУДЬ-ЯКИЙ інструмент окремо з набору TOPTUL GCAI9601. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '8 299₴',
            images: ['3.8.jpg']
        },
        {
            name: 'Набір інструменту комбінованих  97од.  TOPTUL GCAI9701',
            description: "В цей набір включено: • 12 торцевих 6-гранних головок від 4 до 13мм і 10 довгих головок на ¼ дюйма, • 18 торцевих 6-гранних головок від 10 до 32мм і 10 довгих головок від 10 до 24 на ½ дюйма. • Також у наборі є 3 удлинителя, гнучкий удлинитель, два кардана, держатель біт, вороток-відвертка, вороток з шарніром, вороток з плаваючою головкою, дві трещотки, плоскогубці, бічні різці, набір біт і відвертки: шліцеві та хрестоподібні. Увесь інструмент у наборі метричний, рукоятки прорезинені. Присоединительные квадрати ¼ та ½ дюйма. Також є можливість придбати БУДЬ-ЯКИЙ інструмент окремо з набору TOPTUL GCAI9701. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '8 599₴',
            images: ['3.9.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 106ед. TOPTUL GCAI106B',
            description: "В цей набір включено: • 13 торцевих головок від 4 до 14мм і 3 довгі головки на ¼ дюйма, • 12 торцевих головок від 15 до 32мм і три довгі головки на ½ дюйма, • дві свечні головки, дві трещотки на 36 зубців, • 15 комбінованих ключів від 6 до 22 мм, • велика кількість бітів і насадок, • три удлинителя, 2 кардана, воротки, воротки-відвертки і держатель біт. Увесь інструмент у наборі метричний, рукоятки прорезинені. Присоединительные квадрати ¼ та ½ дюйма. Висока якість інструментів марки TOPTUL забезпечує надійність і тривалість користування набором. Набір інструментів у чемодані - прекрасний варіант для тих, хто любить порядок у всьому. Також є можливість придбати БУДЬ-ЯКИЙ інструмент окремо з набору TOPTUL GCAI106B. На всі торцеві головки та ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '6 999₴',
            images: ['3.10.jpg']
        },
        {
            name: 'Набір інструмента 1/4"&1/2" 108ед. (6-гр.) new box TOPTUL GCAI108R',
            description: "Набор професійного інструмента марки TOPTUL GCAI108R (Тайвань). Набор состоит из 108 единиц инструмента, торцевые головки имеют 6 граней для удобства отвинчивания 'прикипевших' гаек. Отличительной особенностью набора TOPTUL GCAI108R является наличие головок Е профиля (Е-шка или звезда Давида). Также их часто называют 'звездочками' или 'внешний TORX'. Данный тип головок позволяет увеличить силу закручивания деталей, при этом не повреждая и не 'срывая' грани болта. Крепежи Е профиля в автомобиле часто используются в элементах ходовой, двигателя и т.д. Присоединительный квадрат трещеток и воротков: 1/4\" и 1/2\". Все размеры инструмента в наборе - метрические, кейс изготовлен из прочного пластика. Также есть возможность приобретения ЛЮБОГО инструмента из набора TOPTUL GCAI108R отдельно. На все торцевые головки и ключи TOPTUL из набора предоставляется пожизненная гарантия на заводской брак!",
            price: '5 599₴',
            images: ['3.11.jpg']
        },
        {
            name: 'Набір інструмента 1/4"&1/2" 108ед. (12-гр.) new box TOPTUL GCAI108R1',
            description: "Набір інструментів GCAI108R1 1/4\" і 1/2\" на 108 одиниць (торцеві головки 12-граней) має кейс з міцного пластика. Габарити: ширина 38 см, довжина 30 см і висота 8,5 см, загальна вага кейса - 6,9 кг. У наборі міститься: 13 торцевих 12-гранних головок від 4 до 14 мм і 8 довгих головок розміром від 6 до 13 мм на присоединительный квадрат ¼ дюйма. Також 16 торцевих 12-гранних головок від 10 до 32 мм і 5 довгих головок від 14 до 22 мм на присоединительный квадрат ½ дюйма. У комплектацію набору входять також: насадки і головки з насадками: шлиц, HEX, TORX, PH1, PH2, PH3, PH4, PZ1, PZ2, PZ3, PZ4. 4 удлинителя, вороток-вила, 2 кардана, вороток з плаваючою головкою, перехідник з отвором, 2 трещотки, тримач біт, 2 свічні головки на 16 - 21 мм і 3 12-гранних г-подібних ключа. Відмітною особливістю набору TOPTUL GCAI108R1 є наявність головок Е-профілю (зірка Давида). Також є можливість придбати БУДЬ-ЯКИЙ інструмент окремо з набору TOPTUL GCAI108R1. На всі торцеві головки і ключі TOPTUL з набору надається пожиттєва гарантія на заводський брак.",
            price: '5 599₴',
            images: ['3.12.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 1/4"&1/2", ключі 6-32мм, 130ед. (12-гр.) TOPTUL GCAI130T1',
            description: "Набор инструментов комбинированный 1/4\" и 1/2\" на 130 единиц (12-граней) TOPTUL GCAI130T1 - это незаменимый комплект для мастерской или гаража. Он содержит 49 различных инструментов для выполнения широкого спектра задач, включая затяжку гаек, сверление отверстий, резку и снятие винтов и шурупов. В наборе разнообразные насадки, биты, плоскогубцы, кусачки и другие инструменты, изготовленные из качественных материалов для долговечности и надежности. Каждый инструмент защищен стойкой к коррозии обработкой. Легкий и компактный набор легко хранить в одном месте, обеспечивая удобство транспортировки и доступность нужных инструментов в любой момент. Этот набор идеально подходит для работ в доме, на огороде или на рабочем месте, делая его незаменимым помощником в ремонте и строительстве.",
            price: '14 299₴',
            images: ['3.13.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 1/4"&3/8"&1/2" 144ед. TOPTUL GCAI144R',
            description: "Набор инструмента комбинированный TOPTUL GCAI144R состоит из 144 единиц, и его отличительной особенностью является наличие слесарного инструмента, подходящего как для СТО, так и для личного пользования. Все инструменты плотно защелкиваются в кейсе, исключая выпадение. Комплектация включает торцевые головки, длинные головки, трещотки, воротки, удлинители, карданы, свечные головки, комбинированные рожково-накидные ключи, отвертки, пассатижи, переставные плоскогубцы, длинногубцы и молоток. Весь инструмент метрический, с прорезиненными рукоятками, и имеет присоединительные квадраты 1/2 и 1/4 дюйма. Также есть возможность приобретения любого инструмента из набора TOPTUL GCAI144R отдельно, и на все торцевые головки и ключи TOPTUL из набора предоставляется пожизненная гарантия на заводский брак.",
            price: '12 799₴',
            images: ['3.14.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 150ед. TOPTUL GCAI150R',
            description: "Набор профессионального инструмента TOPTUL GCAI150R состоит из 150 предметов. Кейс выполнен из прочного пластика, закрывается с помощью четырех замков - два основных металлических и два дополнительных пластиковых. Инструменты плотно защелкиваются в своих гнездах, предотвращая их выпадение. Набор включает торцевые головки под присоединительный квадрат 1/4 и 1/2 дюйма до 32мм, трещотки, воротки, удлинители, карданы, свечные головки, головки Е-типа и различные насадки. Отличительные черты - комбинированные рожково-накидные ключи, разрезные ключи, Г-образные шестигранники, молоток, бокорезы, плоскогубцы, клещи с фиксатором, отвертки, набор выколоток и зубил. Все инструменты метрические, с прорезиненными рукоятками. Этот набор представляет собой самый полный набор высококлассного инструмента как для профессионалов, так и для любителей. Весь инструмент изготовлен из первоклассных сплавов хромванадия и прошел специальную термическую обработку и контроль качества. Также можно приобрести любой инструмент из набора отдельно, и на все торцевые головки и ключи предоставляется пожизненная гарантия на заводский брак.",
            price: '12 899₴',
            images: ['3.15.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 1/4"&3/8"&1/2" 163ед. TOPTUL GCAI163R',
            description: "Набор инструментов комбинированный 1/4\", 3/8\" и 1/2\" на 163 единицы - незаменимый комплект для любого мастера. Сатиновое покрытие и метрические измерения обеспечивают высокое качество и долговременное использование. В наборе содержится все необходимое для ремонтных работ. Удобный кейс обеспечивает сохранность инструментов и легкость транспортировки.",
            price: '14 399₴',
            images: ['3.16.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 1/4"&3/8"&1/2" 216ед. TOPTUL GCAI216R',
            description: "Набор инструмента комбинированный TOPTUL GCAI216R для 1/4\", 3/8\" и 1/2\" дюйма содержит 216 единиц инструмента, упакованных в прочный пластиковый кейс с габаритами 56x41x12 см. Кейс закрывается четырьмя замками для надежной защиты. Все инструменты плотно укладываются в гнезда, исключая выпадение. Набор включает трещотки, головки различных размеров, биты, свечные головки, удлинители, карданы, комбинированные ключи, шестигранники и другие аксессуары. Все инструменты метрические, с прорезиненными рукоятками для удобства использования. Они изготовлены из высококачественных материалов, обеспечивая надежность и долговечность. В наборе предоставляется пожизненная гарантия на заводский брак.",
            price: '11 599₴',
            images: ['3.17.jpg']
        },
        {
            name: 'Професійний набір інструментів у кейсі MOLDER 1/2" & 1/4" & 3/8" 72Т. CR-V 219 одиниць (MT60219)',
            description: "Професійний набір інструментів у кейсі MOLDER 219 предметів. Особливості набору інструменту: Все необхідне в одній валізі. Комплект із 219 одиницю підібрано так, що вам більше не потрібно шукати інший інструмент. Всі тріскачки та головки стійкі до зносу та корозії. Виготовлені з легованої сталі з додаванням Cr-V, ці присадки підвищують міцність, стійкість до корозії й утворення іржі. Такі інструменти мають високу межу витривалості та не схильні до крихкого руйнування. Зручні, міцні тріскачкові ручки 1/2\", 1/4\" і 3/8\". Тріскачки не іржавіють, стійкі до статистичних і динамічних навантажень, мають гарні електроізоляційні властивості, покриті зносостійким поліпропіленом. Механізм на 72 зубці забезпечує плавний хід, є швидке скидання і фіксація головок. Двокомпонентна ручка зручно лежить у руці та не вислизає завдяки гумовим вставкам.",
            price: '5 999₴',
            images: ['3.18(1).jpg', '3.18(2).jpg']
        },
        {
            name: 'Набір інструмента 1/4"&1/2" 94ед. (6-гр.) СТАНДАРТ STM-0094-6',
            description: "Набор инструментов STANDART STM-0094-6 включает 94 единицы инструмента для 1/4\" и 1/2\" дюйма с 6 гранями. Он оснащен металлическими замками для надежной защиты и удобства хранения. Этот набор предоставляет все необходимое для выполнения гаражных работ как для профессионалов, так и для личного использования.",
            price: '3 199₴',
            images: ['3.19.jpg']
        },
        {
            name: 'Набір інструмента 1/4"&1/2" 108ед. (6-гр.) СТАНДАРТ STM-0108-6',
            description: "Инструкция по эксплуатации набора инструментов СТАНДАРТ STM-0108-6: 1 Перед началом использования убедитесь, что все инструменты находятся на своих местах в кейсе и зафиксированы надежно. 2 При необходимости выберите подходящий инструмент для выполняемой задачи. 3 Пользуйтесь инструментами осторожно, следите за безопасностью при работе. 4 После завершения работы верните инструменты обратно в кейс и закройте его на замок для предотвращения потери или повреждения инструментов. 5 Храните набор инструментов в сухом месте, за пределами прямого воздействия солнечных лучей и влаги. Это общие рекомендации. Пожалуйста, обратитесь к специфическим инструкциям производителя, если они предоставлены вместе с набором.",
            price: '3 499₴',
            images: ['3.20.jpg']
        },
        {
            name: 'Набір інструмента комбінованих 175ед. СТАНДАРТ ST-0175',
            description: "Немає опису",
            price: '6 799₴',
            images: ['3.21.jpg']
        },
        {
            name: 'Набір інструментів Cr-V 1/2", 1/4", 108 од. INTERTOOL ET-6108',
            description: "Це найбільш популярний комплект інструменту серед українців, на сьогодні більш як 10 000 звернень за місяць. Вміщує в собі великий спектр можливостей для автомайстра, спеціаліста на СТО та просто дбайливого господаря. Завдяки комплекту із 108 одиниць можна працювати з будь-якими кріпленнями в найважкодоступніших місцях і вузлах автомобілів, робить можливим ремонт від дитячого велосипеду до вантажівки! Знадобиться також майстру вдома, в побуті та у гаражі. Важко знайти таке завдання, яке Ви не змогли б вирішити цим інструментом! Про матеріал виготовлення Витривалість, надійність і міцність - це головні властивості наборів професійної серії. Служать набагато довше подібних і зберігають ваш безцінний час! Всі тріскачки та головки виготовлені з легованої сталі з додаванням Cr-V, вирізняються підвищеною стійкістю до навантажень та корозії, мають запас міцності.",
            price: '3 499₴',
            images: ['3.22.jpg']
        },
        {
            name: 'Набір інструментів 1/2", 3/8", 1/4", 171ед., Cr-V STORM INTERTOOL ET-8171',
            description: "Набори інструментів INTERTOOL STORM – це нове слово у підтримку якості та багатофункціональності. Завдяки своїй практичності ідеально підходять для автолюбителів та домашніх майстрів. Особливості: • Інструмент на довгі роки. Усі комплектуючі виготовлені з високоякісних марок сталі. Завдяки міцності та сучасним технологіям виробництва інструменти відрізняються довготривалим строком служби, стійкістю до підвищених навантажень, а також високою точністю виготовлення. Два шари нікелевого покриття вбережуть від появи іржі. • Надійні трищітки. Механізм трищіток та всі його комплектуючі виготовлені в Тайвані, у поєднанні з Cr-V сталлю – це міцний та надійний інструмент з м’яким ходом храпового механізму. • Зручне зберігання. Весь інструмент укомплектований у надійний, міцний кейс з металевими замками та посиленими петлями. Яскравий сучасний дизайн кейсу нікого не залишить байдужим! • Набір інструментів №1 в Україні. За результатами незалежного рейтингового дослідження в рамках проекту Українська Народна Премія.",
            price: '3 999₴',
            images: ['3.23.jpg']
        },
        {
            name: 'Набір інструментів 1/2, 1/4, 110 од., SUPER LOCK STORM, Cr-V INTERTOOL ET-8110',
            description: "Набори інструментів INTERTOOL STORM – це нове слово в підтримку якості та багатофункціональності! Завдяки своїй практичності підходять для автолюбителів та домашніх майстрів. Широкий вибір інструментів дозволяє впоратися майже з будь-яким типом кріплень, що дуже виручає при виникненні раптової несправності в дорозі або під час роботи в гаражі. Особливості: • Інструмент на довгі роки. Комплектуючі набора виготовлено з високоякісних марок сталі, відрізняються своєю довговічністю, надійністю та захистом від корозії. • Надійні тріскачки. Механізм тріскачток та всі його комплектуючі виготовлено в Тайвані, в поєднанні з Cr-V сталлю – це міцний та надійний інструмент, з м’яким ходом храпового механізму. • Зручне зберігання. Торцеві головки, біти та інші комплектуючі розміщені всередині надійного та компактного кейсу з металевими замками. Інструменти надійно зафіксовані та не випадають зі своїх посадкових місць навіть після транспортування. • Набори інструментів №1 в Україні. За результатами незалежного рейтингового дослідження в рамках проекту Українська Народна Премія з 2018 по 2021 роки.",
            price: '2 999₴',
            images: ['3.24.jpg']
        },
        {
            name: 'Набір інструментів 1/2", 1/4", 111 од., Cr-V INTERTOOL ET-8111',
            description: "Набори інструментів INTERTOOL STORM – це нове слово в підтримку якості та багатофункціональності! Завдяки своїй практичності підходять для автолюбителів та домашніх майстрів. Флагманський набір лінійки STORM на 111 од. дозволяє працювати інструментом 24/7. Широка комплектація включає всі найнеобхідніші торцеві головки та біти. Особливості: • Інструмент на довгі роки. Комплектуючі наборів виготовлені з високоякісних марок сталі та відрізняються довговічністю, надійністю та захистом від корозії. • Надійні тріскачки з храповим механізмом. Механізм тріскачки та всі його комплектуючі виготовлено в Тайвані, в поєднанні з Cr-V сталлю - це міцний та надійний інструмент з м’яким ходом храпового механізму. • Удар по кріпленнях. В комплекті 3 ударні подовжені головки з Сr-Mo найпопулярніших розмірів 17 мм, 19 мм, 21 мм. • Зручне зберігання. Весь інструмент укомплектовано в надійний, міцний кейс з металевими замками та посиленими петлями. • Набори інструментів №1 в Україні. За результатами незалежного рейтингового дослідження в рамках проекту Українська Народна Премія з 2018 по 2021 роки.",
            price: '2 899₴',
            images: ['3.25.jpg']
        }
    ]

    const productList = document.getElementById('product-list');
    products.forEach(product => {
        const productItem = document.createElement('div');
        productItem.className = 'catalog-item';

        const productImages = document.createElement('div');
        productImages.className = 'product-images';

        if (product.images.length > 1) {
            product.images.forEach((image, index) => {
                const img = document.createElement('img');
                img.src = image;
                img.alt = product.name;
                img.className = index === 0 ? 'active' : 'hidden';
                productImages.appendChild(img);
            });

            const prevButton = document.createElement('button');
            prevButton.textContent = '<';
            prevButton.className = 'carousel-button';
            prevButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex - 1 + product.images.length) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const nextButton = document.createElement('button');
            nextButton.textContent = '>';
            nextButton.className = 'carousel-button';
            nextButton.onclick = () => {
                const currentIndex = Array.from(productImages.children).findIndex(child => child.className === 'active');
                const nextIndex = (currentIndex + 1) % product.images.length;
                productImages.children[currentIndex].className = 'hidden';
                productImages.children[nextIndex].className = 'active';
            };

            const carouselButtons = document.createElement('div');
            carouselButtons.className = 'carousel-buttons';
            carouselButtons.appendChild(prevButton);
            carouselButtons.appendChild(nextButton);

            productImages.appendChild(carouselButtons);
        } else {
            const img = document.createElement('img');
            img.src = product.images[0];
            img.alt = product.name;
            productImages.appendChild(img);
        }

        const productDetails = document.createElement('div');
        productDetails.className = 'product-details';

        const productName = document.createElement('h3');
        productName.textContent = product.name;

        const productDescription = document.createElement('p');
        productDescription.textContent = product.description;

        const productPrice = document.createElement('p');
        productPrice.className = 'price';
        productPrice.textContent = `Ціна: ${product.price}`;

        const buyButton = document.createElement('a');
        buyButton.href = 'https://t.me/auto_tool_set';
        buyButton.textContent = 'Купити';
        buyButton.className = 'buy-button';

        productDetails.appendChild(productName);
        productDetails.appendChild(productDescription);
        productDetails.appendChild(productPrice);
        productDetails.appendChild(buyButton);

        productItem.appendChild(productImages);
        productItem.appendChild(productDetails);

        productList.appendChild(productItem);
    });
});